### This jupyter notebook contains contents of the lesson "Arithmetic operators in Series and Dataframe"

**Author : Umidjon Sattorov. Machine Learning engineer**

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [4]:
s1.add(s2)

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [3]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [4]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [5]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

Task : Create two series, one of which should contain integers and other one should contain boolean variables. Multiply first series to second one and return the result.

Task : Create two series, one of which should contain the names of people and the other one should contain surnames of them. Add them together.

____

In [ ]:
s7 = pd.Series([7, 5, 9, 13, 17, 11, 28, 77], index =[1, 2, 3, 4, 5, 6, 7, 8])
sb = pd.Series([True, False, True, True, False, True, False, False], index =[1, "r", "a", "s", 5, "I", 7, "S"])

In [7]:
s7.multiply(sb)

1    7.0
2    NaN
3    NaN
4    NaN
5    0.0
6    NaN
7    0.0
8    NaN
I    NaN
S    NaN
a    NaN
r    NaN
s    NaN
dtype: object

In [9]:
df1 = pd.DataFrame(
    np.arange(9.).reshape(3, 3),
    columns = list('bcd'),
    index = ['Apple', 'Pomegranate', 'Grapes'] 
)

df2 = pd.DataFrame(
    np.arange(12.).reshape(4, 3),
    columns = list('abc'),
    index = ['Apple', 'Pomegranate', 'Melon', 'Fig']
)
df1

               b    c    d
Apple        0.0  1.0  2.0
Pomegranate  3.0  4.0  5.0
Grapes       6.0  7.0  8.0

In [8]:
df2

               a     b     c
Apple        0.0   1.0   2.0
Pomegranate  3.0   4.0   5.0
Melon        6.0   7.0   8.0
Fig          9.0  10.0  11.0

In [9]:
df1+df2

              a    b    c   d
Apple       NaN  1.0  3.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN  7.0  9.0 NaN

In [10]:
df1-df2

              a    b    c   d
Apple       NaN -1.0 -1.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN -1.0 -1.0 NaN

In [11]:
# add() function
df1.add(df2)

              a    b    c   d
Apple       NaN  1.0  3.0 NaN
Fig         NaN  NaN  NaN NaN
Grapes      NaN  NaN  NaN NaN
Melon       NaN  NaN  NaN NaN
Pomegranate NaN  7.0  9.0 NaN

In [12]:
# add() function with fill_value
df1.add(df2, fill_value = 0)

               a     b     c    d
Apple        0.0   1.0   3.0  2.0
Fig          9.0  10.0  11.0  NaN
Grapes       NaN   6.0   7.0  8.0
Melon        6.0   7.0   8.0  NaN
Pomegranate  3.0   7.0   9.0  5.0

Other Arithmetic Operations
add, radd – Addition (+)

* sub, rsub – Subtraction (-)

* div, rdiv – Division (/)

* floordiv, rfloordiv – Floor division (//)

* mul, rmul – Multiplication (*)

* pow, rpow – Exponentiation (**)

All of the operations above support the fill_value parameter.

____

In [31]:
df1.sub(df2, fill_value = 0)

               a     b     c    d
Apple        0.0  -1.0  -1.0  2.0
Fig         -9.0 -10.0 -11.0  NaN
Grapes       NaN   6.0   7.0  8.0
Melon       -6.0  -7.0  -8.0  NaN
Pomegranate -3.0  -1.0  -1.0  5.0

In [ ]:
df2.div(df1, fill_value = 1)

               a          b          c      d
Apple        0.0        inf   2.000000  0.500
Fig          9.0  10.000000  11.000000    NaN
Grapes       NaN   0.166667   0.142857  0.125
Melon        6.0   7.000000   8.000000    NaN
Pomegranate  3.0   1.333333   1.250000  0.200

In [33]:
df2.floordiv(df1, fill_value = 1)

               a     b     c    d
Apple        0.0   inf   2.0  0.0
Fig          9.0  10.0  11.0  NaN
Grapes       NaN   0.0   0.0  0.0
Melon        6.0   7.0   8.0  NaN
Pomegranate  3.0   1.0   1.0  0.0

In [34]:
df1.mul(df2, fill_value = 1)

               a     b     c    d
Apple        0.0   0.0   2.0  2.0
Fig          9.0  10.0  11.0  NaN
Grapes       NaN   6.0   7.0  8.0
Melon        6.0   7.0   8.0  NaN
Pomegranate  3.0  12.0  20.0  5.0

In [ ]:
df1.pow(df2, fill_value = 1)

               a     b       c    d
Apple        1.0   0.0     1.0  2.0
Fig          1.0   1.0     1.0  NaN
Grapes       NaN   6.0     7.0  8.0
Melon        1.0   1.0     1.0  NaN
Pomegranate  1.0  81.0  1024.0  5.0